import "./newsOpen.scss";
import React from "react";
import Navbar from "../../components/Navbar/Navbar";
import Footer from "../../components/Footer/Footer";
import { useParams } from "react-router-dom";

const NewsOpen = () => {
  const newsData = [
    {
      name: "მადლობა გაწეული სამუშაოსთვის, ლევან!",
      thumb: "/news/მადლობა გაწეული სამუშაოსთვის, ლევან!.jpg",
      date: "2023",
      content:
        "1 აპრილიდან ჩვენს ლიცენზირების მენეჯერს, ლევან მეტრეველს ვემშვიდობებით. ლევანმა გუნდი ურთიერთშეთანხმების საფუძველზე დატოვა. იგი წლების განმავლობაში გვერდში ედგა გუნდს, რისთვისაც გვინდა გადავუხადოთ მადლობა, ვუსურვოთ წარმატება და წინსვლა.",
    },
    {
      name: "ახალი სეზონის წინ გუნდის განაცხადი",
      thumb: "/news/ახალი სეზონის წინ გუნდის განაცხადი.png",
      date: "2023",
      content: (
        <div>
          <p>
            გაგრამ ახალი, ეროვნული ლიგის 35-ე სეზონისთვის შემადგენლობა სრულად
            დააკომპლექტა. სატრანსფერო აქტივობა დასრულებულია – გთავაზობთ კლუბში
            ახალმოსულთა სიასა და საერთო განაცხადს:
          </p>

          <h2>მოვიდნენ:</h2>
          <ul>
            <li>ლევან კაკუბავა (საბურთალო)</li>
            <li>თორნიკე ჯანგიძე (დინამო თბილისი II)</li>
            <li>გიორგი ლაცაბიძე (საბურთალო)</li>
            <li>ანდრო ნემსაძე (სიონი)</li>
            <li>ბექა შუბითიძე (სპაერი)</li>
            <li>კახა კაკაშვილი (შუქურა)</li>
            <li>ლევან ჟორდანია (სიონი)</li>
            <li>მათეუს მარკონდელე (Hegelmann)</li>
            <li>თორნიკე ოქრიაშვილი (უგუნდოდ)</li>
            <li>ლუკა ჩაგანავა (სიონი)</li>
            <li>ზურაბ მუსელიანი (შუქურა)</li>
            <li>როინ ოდიშელიძე (სპაერი)</li>
            <li>იდირ ბუტრიფი (MC Algiers)</li>
          </ul>

          <h2>მეკარეები:</h2>
          <ul>
            <li>ალექსანდრ ვორობეი</li>
            <li>ნიკა ქავთარაძე</li>
            <li>გიორგი ბედიაშვილი</li>
          </ul>

          <h2>მცველები:</h2>
          <ul>
            <li>ლევან კაკუბავა</li>
            <li>ლუკა ნოზაძე</li>
            <li>თორნიკე ჯანგიძე</li>
            <li>კობა იაძე</li>
            <li>ვასილ ხოსიტაშვილი (C)</li>
            <li>ბექა შუბითიძე</li>
            <li>გიორგი ლაცაბიძე</li>
            <li>ანდრო ნემსაძე</li>
          </ul>

          <h2>ნახევარმცველები:</h2>
          <ul>
            <li>კახა კაკაშვილი</li>
            <li>თემურ შონია</li>
            <li>ერეკლე სულთანიშვილი</li>
            <li>სანდრო შეწირული</li>
            <li>ლევან ჟორდანია</li>
            <li>მათეუს მარკონდელე</li>
            <li>იაროსლავ რიაზანცევი</li>
            <li>გიორგი ლომთაძე</li>
            <li>ლაშა ჩიხრაძე</li>
            <li>ლუკა ჩაგანავა</li>
            <li>თორნიკე ოქრიაშვილი</li>
          </ul>

          <h2>ფორვარდები:</h2>
          <ul>
            <li>ზურაბ მუსელიანი</li>
            <li>როინ ოდიშელიძე</li>
            <li>იდირ ბუტრიფი</li>
          </ul>
        </div>
      ),
    },
    {
      name: "კაკუბავა გაგრაში ითამაშებს",
      thumb: "/news/კაკუბავა გაგრაში ითამაშებს.png",
      date: "2023",
      content: (
        <div>
          <h1>გამოცდილი ცენტრალური მცველი ლევან კაკუბავა გაგრაში ითამაშებს</h1>
          <p>
            32 წლის მოთამაშე კლუბს თავისუფალი აგენტის სტატუსით შეუერთდა და
            კონტრაქტი 2024 წლის ბოლომდე გააფორმა.
          </p>
          <p>
            კაკუბავა საფეხბურთო სამყარომ დინამო თბილისიდან გაიცნო. დინამოს
            გარდა, მრავალი წლის განმავლობაში, სხვადასხვა ქართული კლუბების
            რიგებში, ევროტურნირებზე არაერთი მატჩი ჩაატარა. წარსულში, ამხანაგურ
            მატჩებში საქართველოს ეროვნული ნაკრების ღირსებაც დაიცვა.
          </p>
          <p>
            ლევანი საქართველოს თასის ოთხგზის გამარჯვებულია. ბოლო ორი სეზონის
            განმავლობაში იგი საბურთალოს კაპიტნობდა.
          </p>
        </div>
      ),
    },
    {
      name: "ბრაზილიელი შემტევი გაგრაში",
      thumb: "/news/ბრაზილიელი შემტევი გაგრაში.jpg",
      date: "2023",
      content: (
        <div>
          <h1>გაგრა ზამთრის სატრანსფერო ფანჯრის დროს ლეგიონერით გაძლიერდა</h1>
          <p>
            ჩვენს კლუბს ბრაზილიელი შემტევი ნახევარმცველი მათეუს მარკონდელე
            შეუერთდა.
          </p>
          <p>26 წლის მოთამაშემ კლუბთან ხელი ორწლიან კონტრაქტს მოაწერა.</p>
          <p>
            მარკონდელე უნივერსალური თვისებებით გამოირჩევა, ცაცია ბრაზილიელს
            როგორც გამთამაშებლად, ისე ვინგერის პოზიციებიდან თამაში შეუძლია.
          </p>
          <p>
            მისთვის გაგრა პირველი ევროპული გამოცდილება არ არის. გასულ სეზონში
            მარკონდელე ლიეტუვის ჩემპიონატში, ჰეგელმანის რიგებში გამოდიოდა.
          </p>
        </div>
      ),
    },
    {
      name: "ახალ სეზონს ახალი მიზნებით ვიწყებთ",
      thumb: "/news/ახალ სეზონს ახალი მიზნებით ვიწყებთ.png",
      date: "2023",
      content: (
        <div>
          <h1>
            მომავალ სეზონს ახალი მიზნებით, ამბიციებითა და შემადგენლობით
            შევხვდებით!
          </h1>
          <p>
            მანამდე კი გვინდა წარმატება ვუსურვოთ იმ მოთამაშეებს, რომლებსაც
            დამდეგი სეზონის წინ დავემშვიდობეთ: თამაზ მაქაცარია, ოთარ ფარულავა,
            ზურაბ სეხნიაშვილი, ნიკოლოზ ჭანტურია, ივანე ხაბელაშვილი, გიორგი
            ბუხაიძე, ტამიმუ უორუ, არფანგ დაფე, მარიო შარბელ ბა 🤝
          </p>
        </div>
      ),
    },
    {
      name: "გაგრა განვითარების ახალ ეტაპზე",
      thumb: "/news/გაგრა განვითარების ახალ ეტაპზე.jpg",
      date: "2021",
      content: (
        <div>
          <p>
            &bdquo;გაგრა&ldquo; განვითარების თვისობრივად სხვა ფაზაში გადადის,
            ამიტომ კლუბის ხელმძღვანელობამ ახალ პროექტებზე მუშაობა დაიწყო. ამ
            პროექტების ფარგლებში შეიცვლება მიდგომა, როგორც კლუბის მენეჯმენტის
            კუთხით, ისე ფეხბურთელებისადმი. ამიერიდან &bdquo;გაგრა&ldquo; მეტად
            ორიენტირებული იქნება უცხოურ ტრანსფერებზე.
          </p>

          <p>
            ამის გამოცდილება გუნდს გააჩნია. გულშემატკივარს ახსოვს თორნიკე
            ოქრიაშვილის ტრანსფერი. ბოლოს მსგავსი რამ გასული სეზონის ბოლოს მოხდა,
            როცა მეკარე კერესელიძე თბილისის &bdquo;დინამოში&ldquo; გადავიდა.
            გვესაუბრება &bdquo;გაგრას&ldquo; გენერალური მენეჯერი ლევან
            მეტრეველი.
          </p>

          <p>
            &ndash; კლუბი მეტად ორიენტირებული იქნება ფეხბურთელების ტრანსფერებზე.
            როცა ფეხბურთელს ვარჩევთ, უმთავრესი კრიტერიუმი არის, რომ მოხდეს
            შემდგომში ამ ფეხბურთელის ტრანსფერი ევროპულ კლუბებში. ჩვენ აფრიკიდან
            ჩამოვიყვანეთ ბენინის 20-წლამდელთა ნაკრები გუნდის ფეხბურთელები.
            საინტერესო მოთამაშეები არიან.
          </p>

          <p>
            &ndash; შეგიძლიათ თქვათ, რომ ისინი &bdquo;გაგრას&ldquo; ფეხბურთელები
            არიან?
          </p>

          <p>
            &ndash; ისინი კლუბში სინჯებზე იმყოფებიან. დღეისთვის, ოფიციალურად
            შემიძლია განვაცხადო, რომ საყრდენი ნახევარმცველი ტამიმუ ოუ
            ო&rsquo;როუ &bdquo;გაგრას&ldquo; ფეხბურთელია. მასთან 2-წლიანი
            კონტრაქტი გავაფორმეთ.
          </p>

          <p>&ndash; ბატონო ლევან, როგორ მოხდა მათი საქართველოში ჩამოყვანა?</p>

          <p>
            &ndash; ჩვენ დავუკავშირდით ცნობილ საფეხბურთო აგენტს ლაშა ჯაკობიას,
            რომელმაც ეს ფეხბურთელები შემოგვთავაზა. მათი ჩამოყვანა ორმხრივი
            თანამშრომლობის საფუძველზე მოხდა.
          </p>

          <p>&ndash; კლუბში სხვა ლეგიონერებიც არიან.</p>

          <p>
            &ndash; ჩვენ დავიმატეთ უკრაინელი მეკარე ოლექსანდრ ვორობეი. მასთან
            კონტრაქტი სეზონის ბოლომდე გავაფორმეთ + 1-ის პერსპექტივით. გუნდში
            ასევე ველოდებით სენეგალელ გარემარბ დაფეს, რომელსაც საქართველოში
            თამაშის გამოცდილება აქვს.
          </p>

          <p>&ndash; და ქართული ტრანსფერები.</p>

          <p>
            &ndash; გუნდში დაბრუნდა თამაზ მაქაცარია, რომელთანაც ვორობეის
            მსგავსი, ანალოგიური კონტრაქტი გავაფორმეთ. თამაზი მაღალი კლასის
            ფორვარდია და მისი ძალიან გვეიმედება. დავიმატეთ ლომთაძე, ცოტა უფრო
            ადრე ლომინაძე. ვფიქრობ, ბრძოლისუნარიანი გუნდი გვეყოლება.
          </p>

          <p>
            &ndash; არსებობს საინვესტიციო პროექტიც, რომელზეც კლუბის
            ხელმძღვანელობა აქტიურად მუშაობს. რას იტყვით ამ პროექტის შესახებ?
          </p>

          <p>
            &ndash; საინვესტიციო პროექტზე დიდი ენერგიით არის ჩართული კლუბის
            ხელმძღვანელობა. პირადად პრეზიდენტი და ვიცე-პრეზიდენტი, &ndash;
            ბატონები ბესო და გოდერძი ჩიხრაძეები. საუბარია კლუბის
            განვითარებისთვის საჭირო ინვესტიციაზე. მოლაპარაკებები აქტიურ ფაზაშია
            გადასული. გამოიკვეთა კარგი პერსპექტივები. იმედი გვაქვს, რომ
            დაინტერესებულ მხარეებთან თანამშრომლობამდე მივალთ.
          </p>
        </div>
      ),
    },
  ];
  const params = useParams();

  return (
    <div className="news-open">
      <Navbar backImage={true} />
      <div className="no-wrapper">
        <div className="no-wrap">
          <div className="title">
            <img src="/images/icons/arrow-back.png" alt="" className="back" />
            <span>{newsData[params.newsId].name}</span>
          </div>

          <div className="story-box">
            <img src={newsData[params.newsId].thumb} alt="" className="thumb" />

            <div className="date">{newsData[params.newsId].date}</div>

            <div className="story-content">
              {newsData[params.newsId].content}
            </div>
          </div>
        </div>

        <div className="more-news">
          <div className="more-title">სხვა სიახლეები</div>
          <div className="story-card-wrap">
            <div className="story-card">
              <img
                src="/images/assets/gagra-back.png"
                alt=""
                className="more-thumb"
              />
              <div className="info">
                <div className="date">აპრილი 6, 2023</div>
                <div className="a-title">
                  მადლობა გაწეული სამუშაოსთვის, ლევან!
                </div>
              </div>
            </div>
            <div className="story-card">
              <img
                src="/images/assets/gagra-back.png"
                alt=""
                className="more-thumb"
              />
              <div className="info">
                <div className="date">აპრილი 6, 2023</div>
                <div className="a-title">
                  მადლობა გაწეული სამუშაოსთვის, ლევან!
                </div>
              </div>
            </div>
            <div className="story-card">
              <img
                src="/images/assets/gagra-back.png"
                alt=""
                className="more-thumb"
              />
              <div className="info">
                <div className="date">აპრილი 6, 2023</div>
                <div className="a-title">
                  მადლობა გაწეული სამუშაოსთვის, ლევან!
                </div>
              </div>
            </div>
            <div className="story-card">
              <img
                src="/images/assets/gagra-back.png"
                alt=""
                className="more-thumb"
              />
              <div className="info">
                <div className="date">აპრილი 6, 2023</div>
                <div className="a-title">
                  მადლობა გაწეული სამუშაოსთვის, ლევან!
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
};

export default NewsOpen;
